models/Paragraphs.dot
digraph G {
  graph [splines="ortho" pad=0.5 ranksep="1.2.equally" nodesep="1.2.equally"]
  edge [color="gray50"]
  node [shape="box" fontname="Helvetica-bold"]

  BasicBlock [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>BasicBlock</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]
  
  ParagraphBlock [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>ParagraphBlock</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+contents : BasicElement&#91;0..*&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+alignment : TextAlignment&#91;0..1&#93;</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]
  
  ParagraphsBlock [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>ParagraphsBlock</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+contents : ParagraphWithFootnote&#91;0..*&#93;</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]
  
  ParagraphWithFootnote [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>ParagraphWithFootnote</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+footnotes : ReferenceToldWithParagraphElement&#91;0..*&#93;</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]
  
  TextAlignment [
    shape="plain"
    fontname="Helvetica"
    label=<<TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER">«enumeration»</TD></TR>\n<TR><TD ALIGN="CENTER"><B>TextAlignment</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">left</TD></TR>
            <TR><TD ALIGN="LEFT">center</TD></TR>
            <TR><TD ALIGN="LEFT">right</TD></TR>
            <TR><TD ALIGN="LEFT">justified</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>>]

  BasicBlock -> ParagraphBlock [dir="back" arrowtail="onormal" arrowhead="onormal"]
  BasicBlock -> ParagraphsBlock [dir="back" arrowtail="onormal" arrowhead="onormal"]
  ParagraphBlock -> ParagraphWithFootnote [dir="back" arrowtail="onormal" arrowhead="onormal"]
  TextAlignment -> ParagraphBlock [dir="direct" arrowtail="onormal" arrowhead="vee"]
}
